---
kind: property
id: P:Autodesk.Revit.DB.Macros.ModuleSettings.Description
source: html/1dc8401f-d1e2-4a42-c362-8ce777134425.htm
---
# Autodesk.Revit.DB.Macros.ModuleSettings.Description Property

The module description.

## Syntax (C#)
```csharp
public string Description { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null